In [39]:
#importing the necessary libraries.
import pandas as pd

In [40]:
#reading the '.csv' file into a data frame using pandas library's functions (read_csv(),DataFrame()) respectively.
df = pd.read_csv(r"C:\Users\msi-pc\OneDrive\Desktop\CodeLab_\employees.csv", header = 0) 
#header set to 0 to include the same table header from the '.csv' file for the data frame header.
df1 = pd.DataFrame(df)
df1

   First Name  Gender    Salary  Bonus %             Team
0     Douglas    Male   97308.0    6.945        Marketing
1      Thomas    Male   61933.0    4.170           Others
2       Maria  Female  130590.0   11.858          Finance
3       Jerry    Male  138705.0    9.340          Finance
4       Larry    Male  101004.0    1.389  Client Services
..        ...     ...       ...      ...              ...
94      Harry    Male  130620.0    7.030            Legal
95    Heather  Female   43026.0   14.166  Client Services
96    Cynthia  Female  142321.0    1.737          Finance
97      Laura  Female  140371.0   10.620        Marketing
98       Tina  Female  100705.0   16.961        Marketing

[99 rows x 5 columns]

In [41]:
#removing the first column (First Name) from the data frame, using (drop()) function, setting axis to 1 for column removal and 0 for row removal (taking into consideration that we need to replace 'First Name' with the target row index).
df2 = df1.drop(['First Name'], axis = 1)
df2

    Gender    Salary  Bonus %             Team
0     Male   97308.0    6.945        Marketing
1     Male   61933.0    4.170           Others
2   Female  130590.0   11.858          Finance
3     Male  138705.0    9.340          Finance
4     Male  101004.0    1.389  Client Services
..     ...       ...      ...              ...
94    Male  130620.0    7.030            Legal
95  Female   43026.0   14.166  Client Services
96  Female  142321.0    1.737          Finance
97  Female  140371.0   10.620        Marketing
98  Female  100705.0   16.961        Marketing

[99 rows x 4 columns]

In [42]:
#checking the data frame for None/NaN values using (isnull()) function.
df2.isnull()

    Gender  Salary  Bonus %   Team
0    False   False    False  False
1    False   False    False  False
2    False   False    False  False
3    False   False    False  False
4    False   False    False  False
..     ...     ...      ...    ...
94   False   False    False  False
95   False   False    False  False
96   False   False    False  False
97   False   False    False  False
98   False   False    False  False

[99 rows x 4 columns]

In [43]:
#since it is a large data base, we will check and show only the null values within every column.
df2[df2.isnull().any(axis = 1)]

    Gender    Salary  Bonus %                  Team
11  Female  102508.0      NaN                 Legal
24    Male       NaN   13.873       Client Services
27    Male  122367.0      NaN                 Legal
47  Female       NaN    9.000       Client Services
51    Male       NaN   14.009                 Sales
54  Female   83677.0      NaN           Engineering
59  Female       NaN   11.279           Engineering
67  Female       NaN    9.735               Finance
73  Female   90582.0      NaN                 Sales
74    Male       NaN   17.029             Marketing
85    Male       NaN    3.887       Client Services
92  Female  119009.0      NaN  Business Development

In [44]:
#the null values that were found were 12 values spreaded all throughout the data frame.
#we will try to fill the missing values in each column, by taking the mean value of that column.

In [45]:
#first column that will be filled is the "Salary" column, using (fillna()) function with the (mean()) of the column to replace the null values, inplace is set to True to replace the values permanently.
df2.Salary.fillna(df2.Salary.mean(), inplace=True)
df2[df2.isnull().any(axis=1)] #after filling the column, we will check the null values again.

    Gender    Salary  Bonus %                  Team
11  Female  102508.0      NaN                 Legal
27    Male  122367.0      NaN                 Legal
54  Female   83677.0      NaN           Engineering
73  Female   90582.0      NaN                 Sales
92  Female  119009.0      NaN  Business Development

In [46]:
#checking a previously null value from the "Salary" column. using (iloc[]) function to explore the entire row of the value. 
df2.iloc[47] #mean value = 94199.2

Gender              Female
Salary             94199.2
Bonus %                  9
Team       Client Services
Name: 47, dtype: object

In [47]:
#filling the second column 'Bonus %' with the mean value too.
df2['Bonus %'].fillna(df2['Bonus %'].mean(), inplace=True)
df2.iloc[27] #checking for the previously null values again, mean = 9.97779

Gender        Male
Salary      122367
Bonus %    9.97779
Team         Legal
Name: 27, dtype: object

In [48]:
df2[df2.isnull().any(axis=1)] #no more null values within the data frame.

Empty DataFrame
Columns: [Gender, Salary, Bonus %, Team]
Index: []

In [10]:
#replacing the string values within the data frame in 'Gender and Team' columns with integer values using (replace()) function, as Machine Learning only deals with numbers. 
df2.replace(to_replace='Male', value=0, inplace=True)
df2.replace(to_replace='Female', value=1, inplace=True)
df2.replace(to_replace='Marketing', value=0, inplace=True)
df2.replace(to_replace='Finance', value=1, inplace=True)
df2.replace(to_replace='Client Services', value=2, inplace=True)
df2.replace(to_replace='Legal', value=3, inplace=True)
df2.replace(to_replace='Product', value=4, inplace=True)
df2.replace(to_replace='Engineering', value=5, inplace=True)
df2.replace(to_replace='Business Development', value=6, inplace=True)
df2.replace(to_replace='Human Resources', value=7, inplace=True)
df2.replace(to_replace='Sales', value=8, inplace=True)
df2.replace(to_replace='Distribution', value=9, inplace=True)
df2.replace(to_replace='Others', value=10, inplace=True)
df2

    Gender    Salary  Bonus %  Team
0        0   97308.0    6.945     0
1        0   61933.0    4.170    10
2        1  130590.0   11.858     1
3        0  138705.0    9.340     1
4        0  101004.0    1.389     2
..     ...       ...      ...   ...
94       0  130620.0    7.030     3
95       1   43026.0   14.166     2
96       1  142321.0    1.737     1
97       1  140371.0   10.620     0
98       1  100705.0   16.961     0

[99 rows x 4 columns]

In [11]:
#making a dictionary to map all the string values in the 'Team' column that were converted into integers.
df3={'Marketing':0, 'Finance':1, 'Client Services':2, 'Legal':3, 'Product':4, 'Engineering':5, 'Business Development':6, 'Human Resources': 7, 'Sales':8, 'Distribution':9, 'Others':10}
df3

{'Marketing': 0,
 'Finance': 1,
 'Client Services': 2,
 'Legal': 3,
 'Product': 4,
 'Engineering': 5,
 'Business Development': 6,
 'Human Resources': 7,
 'Sales': 8,
 'Distribution': 9,
 'Others': 10}

In [14]:
#saving the new modified data frame into a (.csv) file using (to_csv()) function, with the same header and without the indeces.
df2.to_csv('AssignmentSolution.csv', header = True, index = False)